docs/posts/2015-05-08-unexpected-grace.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 26, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Unexpected Grace</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Unexpected Grace</h1>
<p class="subtitle" role="doc-subtitle">May 08, 2015</p>
</header><p>
This week&rsquo;s prayer is simple, but informed by events of the week that profoundly impacted me. First, NorthHaven Church​ was in the area that sustained some wind damage in Wednesday night&rsquo;s storm. The next day, Imam Imad Enchassi​ of the Islamic Society of Greater Oklahoma City graciously asked if we needed any help. To all our Muslim friends, <i>As-Salaam-Alaikum</i>.
</p>

<p>
Second, I see in my students a level of spiritual depth that I certainly did not have in my 20&rsquo;s and may not yet have in my 50&rsquo;s — one that moves beyond the superficial trivialities that pass for spirituality in much of American religion, but instead shows a deep understanding of the message of Jesus.
</p>

<p>
Gracious and Loving God,
</p>

<p>
Thank you for those moments<br>
when grace breaks in<br>
to interrupt our lives<br>
in surprising ways,<br>
and unexpected voices<br>
teach us once again<br>
what it means<br>
to follow Jesus.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orgc709d55">
<p>
Tagged: prayer religion
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 26, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
